In [2]:
from database_utils import DatabaseConnector
from data_extraction import DataExtractor
from dateutil.parser import parse
import pandas as pd

In [3]:
filepath = 'db_creds.yaml'
connector = DatabaseConnector()
extractor = DataExtractor()
credentials = connector.read_db_creds(filepath)
engine1, engine2 = connector.init_db_engine(credentials)

In [4]:
tables_in_database = connector.list_db_tables(engine1)
tables_in_database

['legacy_store_details', 'legacy_users', 'orders_table']

In [5]:
table = extractor.read_rds_table('legacy_users', conn=engine1)

<class 'pandas.core.frame.DataFrame'>

In [6]:
table

,index,first_name,last_name,date_of_birth,company,email_address,address,country,country_code,phone_number,join_date,user_uuid
0,0,Sigfried,Noack,1990-09-30,Heydrich Junitz KG,rudi79@winkler.de,Zimmerstr. 1/0\n59015 Gießen,Germany,DE,+49(0) 047905356,2018-10-10,93caf182-e4e9-4c6e-bebb-60a1a9dcf9b8
1,1,Guy,Allen,1940-12-01,Fox Ltd,rhodesclifford@henderson.com,Studio 22a\nLynne terrace\nMcCarthymouth\nTF0 9GH,United Kingdom,GB,(0161) 496 0674,2001-12-20,8fe96c3a-d62d-4eb5-b313-cf12d9126a49
2,2,Harry,Lawrence,1995-08-02,"Johnson, Jones and Harris",glen98@bryant-marshall.co.uk,92 Ann drive\nJoanborough\nSK0 6LR,United Kingdom,GB,+44(0)121 4960340,2016-12-16,fc461df4-b919-48b2-909e-55c95a03fe6b
3,3,Darren,Hussain,1972-09-23,Wheeler LLC,daniellebryan@thompson.org,19 Robinson meadow\nNew Tracy\nW22 2QG,United Kingdom,GB,(0306) 999 0871,2004-02-23,6104719f-ef14-4b09-bf04-fb0c4620acb0
4,4,Garry,Stone,1952-12-20,Warner Inc,billy14@long-warren.com,3 White pass\nHunterborough\nNN96 4UE,United Kingdom,GB,0121 496 0225,2006-09-01,9523a6d3-b2dd-4670-a51a-36aebc89f579
...,...,...,...,...,...,...,...,...,...,...,...,...
15315,14913,Stephen,Jenkins,1943-08-09,"Thornton, Carroll and Newman",s.jenkins@smith.com,Studio 41I\nJones lodge\nOliviaborough\nE8 3DU,United Kingdom,GB,+44(0)292018946,2016-04-15,2bd3a12f-a92d-4cdd-b99c-fc70572db302
15316,14994,Stephen,Smith,1948-08-20,Robinson-Harris,s.smith@smith.com,530 Young parkway\nMillsfurt\nL4G 7NX,United Kingdom,GB,+44(0)1144960977,2020-07-20,d234c04b-c07c-46a5-a902-526f91478ecc
15317,15012,Stephen,Losekann,1940-10-09,Rosenow,s.losekann@smith.com,Viviane-Fritsch-Straße 3/5\n15064 Bad Liebenwerda,Germany,DE,02984 08192,2021-03-07,1a0a8b7b-7c17-42d8-a946-8a85d5495651
15318,15269,Stephen,Rivera,1952-06-04,"Taylor, Fry and Jones",s.rivera@smith.com,"660 Ross Falls Suite 357\nAnthonymouth, MA 09610",United States,US,239.711.3836,2011-01-03,187fe06e-bd5f-4381-af2f-d7ac37ca7572
15319,1249,Stephen,Duncan,1994-03-27,"Phillips, Brown and Powell",s.duncan@smith.com,Studio 4\nHancock road\nPhillipsview\nST1X 3XB,United Kingdom,GB,+44(0)1314960870,2015-08-28,0589bbca-1d58-4b1f-9d0a-04ed4c57aaa1

In [7]:
table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15320 entries, 0 to 15319
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          15320 non-null  int64
 1   first_name     15320 non-null  object
 2   last_name      15320 non-null  object
 3   date_of_birth  15320 non-null  object
 4   company        15320 non-null  object
 5   email_address  15320 non-null  object
 6   address        15320 non-null  object
 7   country        15320 non-null  object
 8   country_code   15320 non-null  object
 9   phone_number   15320 non-null  object
 10  join_date      15320 non-null  object
 11  user_uuid      15320 non-null  object
dtypes: int64(1), object(11)
memory usage: 1.4+ MB

In [8]:
df = table.copy()

In [9]:
df.isna().mean()*100

index            0.0
first_name       0.0
last_name        0.0
date_of_birth    0.0
company          0.0
email_address    0.0
address          0.0
country          0.0
country_code     0.0
phone_number     0.0
join_date        0.0
user_uuid        0.0
dtype: float64

In [10]:
nulls = ['NULL']
mask = df[df.user_uuid.isin(nulls)]
mask

,index,first_name,last_name,date_of_birth,company,email_address,address,country,country_code,phone_number,join_date,user_uuid
866,867,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
1022,1023,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
1805,1807,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
2103,2103,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
2437,2439,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
2739,6526,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
2764,2764,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
4984,4987,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
5307,5310,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
6920,6927,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
7737,7747,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
10013,10025,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
10224,10237,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
10988,11002,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
11443,11459,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
11598,11615,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
11761,11778,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
11864,11881,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
12092,12110,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
12584,12606,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL
13855,13879,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL

In [11]:
df.replace('NULL', float("NaN"), inplace= True)

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15320 entries, 0 to 15319
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          15320 non-null  int64
 1   first_name     15299 non-null  object
 2   last_name      15299 non-null  object
 3   date_of_birth  15299 non-null  object
 4   company        15299 non-null  object
 5   email_address  15299 non-null  object
 6   address        15299 non-null  object
 7   country        15299 non-null  object
 8   country_code   15299 non-null  object
 9   phone_number   15299 non-null  object
 10  join_date      15299 non-null  object
 11  user_uuid      15299 non-null  object
dtypes: int64(1), object(11)
memory usage: 1.4+ MB

In [13]:
df.dropna(axis=0, how= 'all', inplace= True)

In [14]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15320 entries, 0 to 15319
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          15320 non-null  int64
 1   first_name     15299 non-null  object
 2   last_name      15299 non-null  object
 3   date_of_birth  15299 non-null  object
 4   company        15299 non-null  object
 5   email_address  15299 non-null  object
 6   address        15299 non-null  object
 7   country        15299 non-null  object
 8   country_code   15299 non-null  object
 9   phone_number   15299 non-null  object
 10  join_date      15299 non-null  object
 11  user_uuid      15299 non-null  object
dtypes: int64(1), object(11)
memory usage: 1.4+ MB

In [15]:
df.first_name = df.first_name.astype('string')
df.last_name = df.last_name.astype('string')
df.country = df.country.astype('string')
df.country_code = df.country_code.astype('string')
countries_to_keep = ['United Kingdom', 'Germany', 'United States']
df.country = df.country[df['country'].isin(countries_to_keep)]

In [16]:
df.country_code.value_counts()

country_code
GB            9365
DE            4708
US            1205
GGB              6
FB13AKRI21       1
VSM4IZ4EL3       1
QVUW9JSKY3       1
0CU6LW3NKB       1
PG8MOC0UZI       1
NTCGYW8LVC       1
OS2P9CMHR6       1
IM8MN1L9MJ       1
LZGTB0T5Z7       1
RVRFD92E48       1
XKI9UXSCZ1       1
QREF9WLI2A       1
XPVCZE2L8B       1
5D74J6FPFJ       1
44YAIDY048       1
Name: count, dtype: Int64

In [17]:
gibberish_values = ['5D74J6FPFJ','XPVCZE2L8B','QREF9WLI2A' ,'XKI9UXSCZ1','RVRFD92E48'  ,'IM8MN1L9MJ','LZGTB0T5Z7','FB13AKRI21','OS2P9CMHR6','NTCGYW8LVC' ,'PG8MOC0UZI' ,'0CU6LW3NKB', 'QVUW9JSKY3' , 'VSM4IZ4EL3' , '44YAIDY048']
filtered_df = df[~df.country_code.isin(gibberish_values)]

In [18]:
filtered_df.country_code.value_counts()

country_code
GB     9365
DE     4708
US     1205
GGB       6
Name: count, dtype: Int64

In [19]:
filtered_df.country_code.replace('GGB', 'GB', inplace = True)

C:\Users\mohdi\AppData\Local\Temp\ipykernel_25932\305768321.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  filtered_df.country_code.replace('GGB', 'GB', inplace = True)
C:\Users\mohdi\AppData\Local\Temp\ipykernel_25932\305768321.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df.country_code.replace('GGB', 'GB', inplace = True)

In [20]:
filtered_df.country_code.value_counts()

country_code
GB    9371
DE    4708
US    1205
Name: count, dtype: Int64

In [21]:
filtered_df.date_of_birth = filtered_df.date_of_birth.astype('datetime64[ns]')

C:\Users\mohdi\AppData\Local\Temp\ipykernel_25932\772145195.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df.date_of_birth = filtered_df.date_of_birth.astype('datetime64[ns]')

In [22]:
filtered_df.join_date = filtered_df.join_date.astype('datetime64[ns]')

C:\Users\mohdi\AppData\Local\Temp\ipykernel_25932\2548287808.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  filtered_df.join_date = filtered_df.join_date.astype('datetime64[ns]')

In [23]:
filtered_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 15305 entries, 0 to 15319
Data columns (total 12 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   index          15305 non-null  int64
 1   first_name     15284 non-null  string
 2   last_name      15284 non-null  string
 3   date_of_birth  15284 non-null  datetime64[ns]
 4   company        15284 non-null  object
 5   email_address  15284 non-null  object
 6   address        15284 non-null  object
 7   country        15284 non-null  string
 8   country_code   15284 non-null  string
 9   phone_number   15284 non-null  object
 10  join_date      15284 non-null  datetime64[ns]
 11  user_uuid      15284 non-null  object
dtypes: datetime64[ns](2), int64(1), object(5), string(4)
memory usage: 1.5+ MB

In [24]:
filtered_df.last_name.unique()

<StringArray>
[   'Noack',    'Allen', 'Lawrence',  'Hussain',    'Stone',   'Torres',
   'Morris',  'Roberts',   'Barlow',    'Jones',
 ...
  'Mcgrath',   'Gaines',     'Rios',       'Ho',   'Hayden',     'Neal',
  'Vazquez',  'Burnett',    'Mckay',     'Cobb']
Length: 1177, dtype: string

In [25]:
filtered_df.to_csv("cleaned_legacyusers.csv", index=False)